### Terraform Plan — `dev`

| Step | Status |
|------|--------|
| Format | ✅ |
| Initialize | ✅ |
| Validate | ✅ |
| Plan | ✅ |


<details><summary>📋 Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_key_vault_secret.app_secret will be created
  + resource "azurerm_key_vault_secret" "app_secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/7fb0d5a2-5652-42fc-9480-79b57af445a4/resourceGroups/rg-kingsila-dev/providers/Microsoft.KeyVault/vaults/kv-kingsila-dev"
      + name                    = "connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.web will be created
  + resource "azurerm_linux_web_app" "web" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "westeurope"
      + name                                           = "kingsila-app-dev-web"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-kingsila-dev"
      + service_plan_id                                = "/subscriptions/7fb0d5a2-5652-42fc-9480-79b57af445a4/resourceGroups/rg-kingsila-dev/providers/Microsoft.Web/serverFarms/kingsila-app-dev-asp"
      + site_credential                                = (sensitive value)
      + virtual_network_backup_restore_enabled         = false
      + virtual_network_subnet_id                      = "/subscriptions/7fb0d5a2-5652-42fc-9480-79b57af445a4/resourceGroups/rg-kingsila-dev/providers/Microsoft.Network/virtualNetworks/vnet-kingsila-dev/subnets/snet-appsvc"
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + dotnet_version = "8.0"
            }
        }
    }

  # azurerm_role_assignment.kv_terraform_dev will be created
  + resource "azurerm_role_assignment" "kv_terraform_dev" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "be8514e5-2b03-4322-9810-1e7f97e7c14e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/7fb0d5a2-5652-42fc-9480-79b57af445a4/resourceGroups/rg-kingsila-dev/providers/Microsoft.KeyVault/vaults/kv-kingsila-dev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ webapp_url                      = "kingsila-app-dev-web.azurewebsites.net" -> (known after apply)

```

</details>